def banner():
	print('''
          Калькулятор
████████████████████████████████
████░░██░░░░██░░████████████████
██░░██░░████░░██░░██████████████
░░██░░██░░░░██░░██░░████████████
░░██░░████░░██░░██░░░░██████████
██░░░░░░░░██░░░░░░░░██░░████████
██████░░██░░████░░██░░██░░██████
████░░██░░░░██████░░░░██░░██████
████░░████████████████░░████████
██████░░██░░░░░░░░░░██░░████████
████████░░░░██████░░░░██████████
██░░░░████░░░░░░░░░░████████████
██░░██░░████████████████████████
██░░░░██████░░████░░░░░░████████
██░░██░░██░░██░░████░░██████████
██░░░░██████░░██████░░██████████
#------------------------------#''')
banner(); 
Result = 'Неизвестно'
while True:
   try:
    try:
        str = input('Введите пример: ')
        a, b, c = str.split(' ')
        a = int(a)
        c = int(c)
        if b in ('+'):
            Result = int(a) + int(c)
        elif b in ('-'):
            Result = int(a) - int(c)
        elif b in ('*'):
            Result = int(a) * int(c)
        elif b in ('/'):
            Result = int(a) / int(c)
        else:
            print('Введите корректно знак! ("+","-","*","/")')
    except ValueError:
        if len(str.split('+')) == 2:
            a, *b, c = str.split('+')
            Result = int(a) + int(c)
        elif len(str.split('-')) == 2:
            a, *b, c = str.split('-')
            Result = int(a) + int(c)
        elif len(str.split('*')) == 2:
            a, *b, c = str.split('*')
            Result = int(a) + int(c)
        elif len(str.split('/')) == 2:
            a, *b, c = str.split('/')
            Result = int(a) + int(c)
   except:
            print('Ошибка')
   print('Результат: ', Result)
   Result = 'Неизвестно'
   print('')
   print('#------------------------------#')
   print('')
